// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = +prompt('Введіть число');
// // x = 0;
// // x = -3;
// if (x !== 0) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = +prompt('Введіть число від 0 до 59');
//
// if (time >= 0 && time <= 15) {
//     console.log('1 частина години');
// } else if (time > 15 && time <= 30) {
//     console.log('2 частина години');
// } else if (time > 30 && time <= 45) {
//     console.log('3 частина години');
// } else if (time > 45 && time <= 60) {
//     console.log('4 частина години');
// } else {
//     console.log('Неправильне число');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = +prompt('Введіть число від 1 до 31');
//
// if (day >= 1 && day <= 10) {
//     console.log('1 частина місяця');
// } else if (day > 10 && time <= 20) {
//     console.log('2 1 частина місяця');
// } else if (day > 20 && time <= 31) {
//     console.log('3 1 частина місяця');
// } else {
//     console.log('Неправильне число');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let day = +prompt('Enter number');

// switch (day) {
//     case 1:
//         console.log('monday');
//         break;
//     case 2:
//         console.log('tuesday');
//         break;
//     case 3:
//         console.log('wednesday');
//         break;
//     case 4:
//         console.log('thursday');
//         break;
//     case 5:
//         console.log('friday');
//         break;
//     case 6:
//         console.log('saturday');
//         break;
//     case 7:
//         console.log('sunday');
//         break;
//     default:
//         console.log('not day');
// }

//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

// let x = 2;
// let x = +prompt('Введи перше число:');

// let y = 4;
// let y = +prompt('Введи друге число:');

// if (x > y) {
//     console.log(`Максимальне число ${x}`);
// } else if (y > x) {
//     console.log(`Максимальне число ${y}`);
// } else {
//     console.log('Числа рівні');
// }

//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//       за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let x = 20 || 'default';
x = 'Ukraine' || 'default';
x = true || 'default';
x = '' || 'default';
x = null || 'default';

console.log(x);
